/* automatically generated by rust-bindgen 0.59.2 */

pub const JLINK_EFM8_VIRTUAL_AREA_SIZE: u32 = 16777216;
pub const JLINK_EFM8_START_ADDR_CODE: u32 = 0;
pub const JLINK_EFM8_START_ADDR_IDATA: u32 = 16777216;
pub const JLINK_EFM8_START_ADDR_DDATA: u32 = 33554432;
pub const JLINK_EFM8_START_ADDR_XDATA: u32 = 50331648;
pub const JLINK_EFM8_START_ADDR_DSR: u32 = 67108864;
pub const JLINK_EFM8_START_ADDR_C2: u32 = 83886080;
pub const JLINK_EFM8_START_ADDR_DDATA_PAGE0: u32 = 33554688;
pub const JLINK_EFM8_START_ADDR_DDATA_PAGE1: u32 = 33554944;
pub const JLINK_EFM8_START_ADDR_DDATA_PAGE2: u32 = 33555200;
pub const JLINK_EFM8_START_ADDR_CODE_BANK0: u32 = 65536;
pub const JLINK_EFM8_START_ADDR_CODE_BANK1: u32 = 98304;
pub const JLINK_EFM8_START_ADDR_CODE_BANK2: u32 = 131072;
pub const JLINK_EFM8_OFF_REG_DSR_VERSION: u32 = 0;
pub const JLINK_EFM8_OFF_REG_DSR_DERIVATIVE: u32 = 1;
pub const JLINK_EFM8_FLACL_FORMAT_LOCKBYTE_COMPLEMENT: u32 = 0;
pub const JLINK_EFM8_FLACL_FORMAT_LOCKBYTE: u32 = 1;
pub const JLINK_EFM8_MEM_ACC_TYPE_D: u32 = 0;
pub const JLINK_EFM8_MEM_ACC_TYPE_I: u32 = 1;
pub const JLINK_EFM8_MEM_ACC_TYPE_C2: u32 = 2;
pub const JLINK_EFM8_CUST_CPU_MODULE_DATA_OFF_ADDR_DSRCMD: u32 = 0;
pub const JLINK_EFM8_CUST_CPU_MODULE_DATA_OFF_ADDR_BPENA: u32 = 1;
pub const JLINK_EFM8_CUST_CPU_MODULE_DATA_OFF_ADDR_BP0L: u32 = 2;
pub const JLINK_EFM8_CUST_CPU_MODULE_DATA_OFF_ADDR_BP0H: u32 = 3;
pub const JLINK_EFM8_CUST_CPU_MODULE_DATA_OFF_ADDR_BP1L: u32 = 4;

pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q7_LOW: JLINK_ARM_V8AR_REG = 171;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q7_HIGH: JLINK_ARM_V8AR_REG = 172;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q8_LOW: JLINK_ARM_V8AR_REG = 173;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q8_HIGH: JLINK_ARM_V8AR_REG = 174;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q9_LOW: JLINK_ARM_V8AR_REG = 175;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q9_HIGH: JLINK_ARM_V8AR_REG = 176;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q10_LOW: JLINK_ARM_V8AR_REG = 177;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q10_HIGH: JLINK_ARM_V8AR_REG = 178;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q11_LOW: JLINK_ARM_V8AR_REG = 179;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q11_HIGH: JLINK_ARM_V8AR_REG = 180;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q12_LOW: JLINK_ARM_V8AR_REG = 181;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q12_HIGH: JLINK_ARM_V8AR_REG = 182;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q13_LOW: JLINK_ARM_V8AR_REG = 183;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q13_HIGH: JLINK_ARM_V8AR_REG = 184;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q14_LOW: JLINK_ARM_V8AR_REG = 185;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q14_HIGH: JLINK_ARM_V8AR_REG = 186;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q15_LOW: JLINK_ARM_V8AR_REG = 187;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_Q15_HIGH: JLINK_ARM_V8AR_REG = 188;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_R8: JLINK_ARM_V8AR_REG = 189;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_R9: JLINK_ARM_V8AR_REG = 190;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_R10: JLINK_ARM_V8AR_REG = 191;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_R11: JLINK_ARM_V8AR_REG = 192;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_R12: JLINK_ARM_V8AR_REG = 193;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_R13: JLINK_ARM_V8AR_REG = 194;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_REG_AARCH32_R14: JLINK_ARM_V8AR_REG = 195;
pub const JLINK_ARM_V8AR_REG_JLINK_ARM_V8AR_NUM_REGS: JLINK_ARM_V8AR_REG = 196;
pub type JLINK_ARM_V8AR_REG = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_STRACE_EVENT_INFO {
    pub SizeofStruct: ::std::os::raw::c_uint,
    pub Type: ::std::os::raw::c_uchar,
    pub Op: ::std::os::raw::c_uchar,
    pub AccessSize: ::std::os::raw::c_uchar,
    pub Reserved0: ::std::os::raw::c_uchar,
    pub Addr: ::std::os::raw::c_ulonglong,
    pub Data: ::std::os::raw::c_ulonglong,
    pub DataMask: ::std::os::raw::c_ulonglong,
    pub AddrRangeSize: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_STRACE_EVENT_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_STRACE_EVENT_INFO>(),
        40usize,
        concat!("Size of: ", stringify!(JLINK_STRACE_EVENT_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_STRACE_EVENT_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINK_STRACE_EVENT_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_STRACE_EVENT_INFO>())).SizeofStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_EVENT_INFO),
            "::",
            stringify!(SizeofStruct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_STRACE_EVENT_INFO>())).Type as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_EVENT_INFO),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_STRACE_EVENT_INFO>())).Op as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_EVENT_INFO),
            "::",
            stringify!(Op)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_STRACE_EVENT_INFO>())).AccessSize as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_EVENT_INFO),
            "::",
            stringify!(AccessSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_STRACE_EVENT_INFO>())).Reserved0 as *const _ as usize
        },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_EVENT_INFO),
            "::",
            stringify!(Reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_STRACE_EVENT_INFO>())).Addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_EVENT_INFO),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_STRACE_EVENT_INFO>())).Data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_EVENT_INFO),
            "::",
            stringify!(Data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_STRACE_EVENT_INFO>())).DataMask as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_EVENT_INFO),
            "::",
            stringify!(DataMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_STRACE_EVENT_INFO>())).AddrRangeSize as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_EVENT_INFO),
            "::",
            stringify!(AddrRangeSize)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_STRACE_INST_STAT {
    pub ExecCnt: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_JLINK_STRACE_INST_STAT() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_STRACE_INST_STAT>(),
        8usize,
        concat!("Size of: ", stringify!(JLINK_STRACE_INST_STAT))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_STRACE_INST_STAT>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINK_STRACE_INST_STAT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_STRACE_INST_STAT>())).ExecCnt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_INST_STAT),
            "::",
            stringify!(ExecCnt)
        )
    );
}
pub const ARM_ENDIAN_ARM_ENDIAN_LITTLE: ARM_ENDIAN = 0;
pub const ARM_ENDIAN_ARM_ENDIAN_BIG: ARM_ENDIAN = 1;
pub type ARM_ENDIAN = ::std::os::raw::c_uint;
pub const JLINKARM_RESET_TYPE_JLINKARM_RESET_TYPE_NORMAL: JLINKARM_RESET_TYPE = 0;
pub const JLINKARM_RESET_TYPE_JLINKARM_RESET_TYPE_BP0: JLINKARM_RESET_TYPE = 1;
pub const JLINKARM_RESET_TYPE_JLINKARM_RESET_TYPE_ADI: JLINKARM_RESET_TYPE = 2;
pub const JLINKARM_RESET_TYPE_JLINKARM_RESET_TYPE_NO_RESET: JLINKARM_RESET_TYPE = 3;
pub const JLINKARM_RESET_TYPE_JLINKARM_RESET_TYPE_HALT_WP: JLINKARM_RESET_TYPE = 4;
pub const JLINKARM_RESET_TYPE_JLINKARM_RESET_TYPE_HALT_DBGRQ: JLINKARM_RESET_TYPE = 5;
pub const JLINKARM_RESET_TYPE_JLINKARM_RESET_TYPE_SOFT: JLINKARM_RESET_TYPE = 6;
pub const JLINKARM_RESET_TYPE_JLINKARM_RESET_TYPE_HALT_DURING: JLINKARM_RESET_TYPE = 7;
pub const JLINKARM_RESET_TYPE_JLINKARM_RESET_TYPE_SAM7: JLINKARM_RESET_TYPE = 8;
pub const JLINKARM_RESET_TYPE_JLINKARM_RESET_TYPE_LPC: JLINKARM_RESET_TYPE = 9;
pub const JLINKARM_RESET_TYPE_JLINK_RESET_TYPE_CORE: JLINKARM_RESET_TYPE = 100;
pub const JLINKARM_RESET_TYPE_JLINK_RESET_TYPE_RESET_PIN: JLINKARM_RESET_TYPE = 101;
pub type JLINKARM_RESET_TYPE = ::std::os::raw::c_uint;
pub const JLINK_PCODE_OPERATIONS_JLINK_PCODE_OP_RESET: JLINK_PCODE_OPERATIONS = 0;
pub const JLINK_PCODE_OPERATIONS_JLINK_PCODE_OP_CONNECT: JLINK_PCODE_OPERATIONS = 1;
pub const JLINK_PCODE_OPERATIONS_JLINK_PCODE_OP_UNSECURE: JLINK_PCODE_OPERATIONS = 2;
pub const JLINK_PCODE_OPERATIONS_JLINK_PCODE_OP_SETUP: JLINK_PCODE_OPERATIONS = 3;
pub const JLINK_PCODE_OPERATIONS_JLINK_PCODE_OP_PCODE_DEVICE: JLINK_PCODE_OPERATIONS = 4;
pub const JLINK_PCODE_OPERATIONS_JLINK_PCODE_OP_NUM_OPERATIONS: JLINK_PCODE_OPERATIONS = 5;
pub type JLINK_PCODE_OPERATIONS = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_INDICATOR_CTRL {
    pub IndicatorId: ::std::os::raw::c_ushort,
    pub Override: ::std::os::raw::c_ushort,
    pub InitialOnTime: ::std::os::raw::c_ushort,
    pub OnTime: ::std::os::raw::c_ushort,
    pub OffTime: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_JLINKARM_INDICATOR_CTRL() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_INDICATOR_CTRL>(),
        10usize,
        concat!("Size of: ", stringify!(JLINKARM_INDICATOR_CTRL))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_INDICATOR_CTRL>(),
        2usize,
        concat!("Alignment of ", stringify!(JLINKARM_INDICATOR_CTRL))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_INDICATOR_CTRL>())).IndicatorId as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_INDICATOR_CTRL),
            "::",
            stringify!(IndicatorId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_INDICATOR_CTRL>())).Override as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_INDICATOR_CTRL),
            "::",
            stringify!(Override)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_INDICATOR_CTRL>())).InitialOnTime as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_INDICATOR_CTRL),
            "::",
            stringify!(InitialOnTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_INDICATOR_CTRL>())).OnTime as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_INDICATOR_CTRL),
            "::",
            stringify!(OnTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_INDICATOR_CTRL>())).OffTime as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_INDICATOR_CTRL),
            "::",
            stringify!(OffTime)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JTAG_ID_DATA {
    pub NumDevices: ::std::os::raw::c_int,
    pub ScanLen: ::std::os::raw::c_ushort,
    pub aId: [::std::os::raw::c_uint; 3usize],
    pub aScanLen: [::std::os::raw::c_uchar; 3usize],
    pub aIrRead: [::std::os::raw::c_uchar; 3usize],
    pub aScanRead: [::std::os::raw::c_uchar; 3usize],
}
#[test]
fn bindgen_test_layout_JTAG_ID_DATA() {
    assert_eq!(
        ::std::mem::size_of::<JTAG_ID_DATA>(),
        32usize,
        concat!("Size of: ", stringify!(JTAG_ID_DATA))
    );
    assert_eq!(
        ::std::mem::align_of::<JTAG_ID_DATA>(),
        4usize,
        concat!("Alignment of ", stringify!(JTAG_ID_DATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JTAG_ID_DATA>())).NumDevices as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JTAG_ID_DATA),
            "::",
            stringify!(NumDevices)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JTAG_ID_DATA>())).ScanLen as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JTAG_ID_DATA),
            "::",
            stringify!(ScanLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JTAG_ID_DATA>())).aId as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JTAG_ID_DATA),
            "::",
            stringify!(aId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JTAG_ID_DATA>())).aScanLen as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JTAG_ID_DATA),
            "::",
            stringify!(aScanLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JTAG_ID_DATA>())).aIrRead as *const _ as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(JTAG_ID_DATA),
            "::",
            stringify!(aIrRead)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JTAG_ID_DATA>())).aScanRead as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(JTAG_ID_DATA),
            "::",
            stringify!(aScanRead)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_BP_INFO {
    pub SizeOfStruct: ::std::os::raw::c_uint,
    pub Handle: ::std::os::raw::c_uint,
    pub Addr: ::std::os::raw::c_uint,
    pub Type: ::std::os::raw::c_uint,
    pub ImpFlags: ::std::os::raw::c_uint,
    pub UseCnt: ::std::os::raw::c_uint,
    pub Internal: ::std::os::raw::c_uchar,
    pub Disabled: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_JLINKARM_BP_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_BP_INFO>(),
        28usize,
        concat!("Size of: ", stringify!(JLINKARM_BP_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_BP_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_BP_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_BP_INFO>())).SizeOfStruct as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_BP_INFO),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_BP_INFO>())).Handle as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_BP_INFO),
            "::",
            stringify!(Handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_BP_INFO>())).Addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_BP_INFO),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_BP_INFO>())).Type as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_BP_INFO),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_BP_INFO>())).ImpFlags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_BP_INFO),
            "::",
            stringify!(ImpFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_BP_INFO>())).UseCnt as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_BP_INFO),
            "::",
            stringify!(UseCnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_BP_INFO>())).Internal as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_BP_INFO),
            "::",
            stringify!(Internal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_BP_INFO>())).Disabled as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_BP_INFO),
            "::",
            stringify!(Disabled)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_WP_INFO {
    pub SizeOfStruct: ::std::os::raw::c_uint,
    pub Handle: ::std::os::raw::c_uint,
    pub Addr: ::std::os::raw::c_uint,
    pub AddrMask: ::std::os::raw::c_uint,
    pub Data: ::std::os::raw::c_uint,
    pub DataMask: ::std::os::raw::c_uint,
    pub Ctrl: ::std::os::raw::c_uint,
    pub CtrlMask: ::std::os::raw::c_uint,
    pub WPUnit: ::std::os::raw::c_uchar,
    pub Internal: ::std::os::raw::c_uchar,
    pub Disabled: ::std::os::raw::c_uchar,
    pub Dummy: ::std::os::raw::c_uchar,
    pub UnitMask: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINKARM_WP_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_WP_INFO>(),
        40usize,
        concat!("Size of: ", stringify!(JLINKARM_WP_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_WP_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_WP_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).SizeOfStruct as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).Handle as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(Handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).Addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).AddrMask as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(AddrMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).Data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(Data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).DataMask as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(DataMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).Ctrl as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(Ctrl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).CtrlMask as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(CtrlMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).WPUnit as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(WPUnit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).Internal as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(Internal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).Disabled as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(Disabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).Dummy as *const _ as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(Dummy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_WP_INFO>())).UnitMask as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_WP_INFO),
            "::",
            stringify!(UnitMask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_DATA_EVENT {
    pub SizeOfStruct: ::std::os::raw::c_int,
    pub Type: ::std::os::raw::c_int,
    pub Addr: ::std::os::raw::c_uint,
    pub AddrMask: ::std::os::raw::c_uint,
    pub Data: ::std::os::raw::c_uint,
    pub DataMask: ::std::os::raw::c_uint,
    pub Access: ::std::os::raw::c_uchar,
    pub AccessMask: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_JLINKARM_DATA_EVENT() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_DATA_EVENT>(),
        28usize,
        concat!("Size of: ", stringify!(JLINKARM_DATA_EVENT))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_DATA_EVENT>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_DATA_EVENT))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_DATA_EVENT>())).SizeOfStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DATA_EVENT),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DATA_EVENT>())).Type as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DATA_EVENT),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DATA_EVENT>())).Addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DATA_EVENT),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DATA_EVENT>())).AddrMask as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DATA_EVENT),
            "::",
            stringify!(AddrMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DATA_EVENT>())).Data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DATA_EVENT),
            "::",
            stringify!(Data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DATA_EVENT>())).DataMask as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DATA_EVENT),
            "::",
            stringify!(DataMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DATA_EVENT>())).Access as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DATA_EVENT),
            "::",
            stringify!(Access)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DATA_EVENT>())).AccessMask as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DATA_EVENT),
            "::",
            stringify!(AccessMask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_MOE_INFO {
    pub HaltReason: ::std::os::raw::c_int,
    pub Index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_JLINKARM_MOE_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_MOE_INFO>(),
        8usize,
        concat!("Size of: ", stringify!(JLINKARM_MOE_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_MOE_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_MOE_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_MOE_INFO>())).HaltReason as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_MOE_INFO),
            "::",
            stringify!(HaltReason)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_MOE_INFO>())).Index as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_MOE_INFO),
            "::",
            stringify!(Index)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_FLASH_AREA_INFO {
    pub Addr: ::std::os::raw::c_uint,
    pub Size: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_FLASH_AREA_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_FLASH_AREA_INFO>(),
        8usize,
        concat!("Size of: ", stringify!(JLINK_FLASH_AREA_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_FLASH_AREA_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_FLASH_AREA_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_FLASH_AREA_INFO>())).Addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_AREA_INFO),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_FLASH_AREA_INFO>())).Size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_AREA_INFO),
            "::",
            stringify!(Size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_RAM_AREA_INFO {
    pub Addr: ::std::os::raw::c_uint,
    pub Size: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_RAM_AREA_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_RAM_AREA_INFO>(),
        8usize,
        concat!("Size of: ", stringify!(JLINK_RAM_AREA_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_RAM_AREA_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_RAM_AREA_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RAM_AREA_INFO>())).Addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RAM_AREA_INFO),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RAM_AREA_INFO>())).Size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RAM_AREA_INFO),
            "::",
            stringify!(Size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_FLASH_BANK_INFO {
    pub sBankName: *const ::std::os::raw::c_char,
    pub sAlgoFile: *const ::std::os::raw::c_char,
    pub AlgoType: ::std::os::raw::c_uint,
    pub BaseAddr: ::std::os::raw::c_uint,
    pub paBlockInfo: *const ::std::os::raw::c_void,
    pub pAlgoInfo: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_JLINK_FLASH_BANK_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_FLASH_BANK_INFO>(),
        40usize,
        concat!("Size of: ", stringify!(JLINK_FLASH_BANK_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_FLASH_BANK_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINK_FLASH_BANK_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO>())).sBankName as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO),
            "::",
            stringify!(sBankName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO>())).sAlgoFile as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO),
            "::",
            stringify!(sAlgoFile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO>())).AlgoType as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO),
            "::",
            stringify!(AlgoType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO>())).BaseAddr as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO),
            "::",
            stringify!(BaseAddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO>())).paBlockInfo as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO),
            "::",
            stringify!(paBlockInfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO>())).pAlgoInfo as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO),
            "::",
            stringify!(pAlgoInfo)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_FLASH_BANK_INFO_EXT {
    pub pRAMCodeTurbo_LE: *const ::std::os::raw::c_void,
    pub pRAMCodeTurbo_BE: *const ::std::os::raw::c_void,
    pub pRAMCode_LE: *const ::std::os::raw::c_void,
    pub pRAMCode_BE: *const ::std::os::raw::c_void,
    pub SizeRAMCodeTurbo_LE: ::std::os::raw::c_uint,
    pub SizeRAMCodeTurbo_BE: ::std::os::raw::c_uint,
    pub SizeRAMCode_LE: ::std::os::raw::c_uint,
    pub SizeRAMCode_BE: ::std::os::raw::c_uint,
    pub pPCode: *const ::std::os::raw::c_void,
    pub SizePCode: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_FLASH_BANK_INFO_EXT() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_FLASH_BANK_INFO_EXT>(),
        64usize,
        concat!("Size of: ", stringify!(JLINK_FLASH_BANK_INFO_EXT))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_FLASH_BANK_INFO_EXT>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINK_FLASH_BANK_INFO_EXT))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO_EXT>())).pRAMCodeTurbo_LE as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO_EXT),
            "::",
            stringify!(pRAMCodeTurbo_LE)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO_EXT>())).pRAMCodeTurbo_BE as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO_EXT),
            "::",
            stringify!(pRAMCodeTurbo_BE)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO_EXT>())).pRAMCode_LE as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO_EXT),
            "::",
            stringify!(pRAMCode_LE)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO_EXT>())).pRAMCode_BE as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO_EXT),
            "::",
            stringify!(pRAMCode_BE)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO_EXT>())).SizeRAMCodeTurbo_LE as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO_EXT),
            "::",
            stringify!(SizeRAMCodeTurbo_LE)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO_EXT>())).SizeRAMCodeTurbo_BE as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO_EXT),
            "::",
            stringify!(SizeRAMCodeTurbo_BE)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO_EXT>())).SizeRAMCode_LE as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO_EXT),
            "::",
            stringify!(SizeRAMCode_LE)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO_EXT>())).SizeRAMCode_BE as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO_EXT),
            "::",
            stringify!(SizeRAMCode_BE)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO_EXT>())).pPCode as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO_EXT),
            "::",
            stringify!(pPCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_FLASH_BANK_INFO_EXT>())).SizePCode as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_FLASH_BANK_INFO_EXT),
            "::",
            stringify!(SizePCode)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_PCODE_INFO {
    pub pPCode: *const ::std::os::raw::c_uchar,
    pub NumBytes: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_PCODE_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_PCODE_INFO>(),
        16usize,
        concat!("Size of: ", stringify!(JLINK_PCODE_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_PCODE_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINK_PCODE_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_PCODE_INFO>())).pPCode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_PCODE_INFO),
            "::",
            stringify!(pPCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_PCODE_INFO>())).NumBytes as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_PCODE_INFO),
            "::",
            stringify!(NumBytes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_DEVICE_INFO {
    pub SizeOfStruct: ::std::os::raw::c_uint,
    pub sName: *const ::std::os::raw::c_char,
    pub CoreId: ::std::os::raw::c_uint,
    pub FlashAddr: ::std::os::raw::c_uint,
    pub RAMAddr: ::std::os::raw::c_uint,
    pub EndianMode: ::std::os::raw::c_char,
    pub FlashSize: ::std::os::raw::c_uint,
    pub RAMSize: ::std::os::raw::c_uint,
    pub sManu: *const ::std::os::raw::c_char,
    pub aFlashArea: [JLINK_FLASH_AREA_INFO; 32usize],
    pub aRAMArea: [JLINK_RAM_AREA_INFO; 32usize],
    pub Core: ::std::os::raw::c_uint,
    pub aFlashBank: [JLINK_FLASH_BANK_INFO; 16usize],
    pub aPCodes: [JLINK_PCODE_INFO; 10usize],
    pub aFlashBankExt: [JLINK_FLASH_BANK_INFO_EXT; 16usize],
    pub sNote: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_JLINKARM_DEVICE_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_DEVICE_INFO>(),
        2400usize,
        concat!("Size of: ", stringify!(JLINKARM_DEVICE_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_DEVICE_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINKARM_DEVICE_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).SizeOfStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).sName as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(sName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).CoreId as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(CoreId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).FlashAddr as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(FlashAddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).RAMAddr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(RAMAddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).EndianMode as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(EndianMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).FlashSize as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(FlashSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).RAMSize as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(RAMSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).sManu as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(sManu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).aFlashArea as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(aFlashArea)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).aRAMArea as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(aRAMArea)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).Core as *const _ as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(Core)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).aFlashBank as *const _ as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(aFlashBank)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).aPCodes as *const _ as usize },
        1208usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(aPCodes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).aFlashBankExt as *const _ as usize
        },
        1368usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(aFlashBankExt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_DEVICE_INFO>())).sNote as *const _ as usize },
        2392usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_INFO),
            "::",
            stringify!(sNote)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_DEVICE_SELECT_INFO {
    pub SizeOfStruct: ::std::os::raw::c_uint,
    pub CoreIndex: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINKARM_DEVICE_SELECT_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_DEVICE_SELECT_INFO>(),
        8usize,
        concat!("Size of: ", stringify!(JLINKARM_DEVICE_SELECT_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_DEVICE_SELECT_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_DEVICE_SELECT_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_DEVICE_SELECT_INFO>())).SizeOfStruct as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_SELECT_INFO),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_DEVICE_SELECT_INFO>())).CoreIndex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_DEVICE_SELECT_INFO),
            "::",
            stringify!(CoreIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_JTAG_DEVICE_CONF {
    pub SizeOfStruct: ::std::os::raw::c_uint,
    pub IRLen: ::std::os::raw::c_uint,
    pub IRPrint: ::std::os::raw::c_uint,
    pub Id: ::std::os::raw::c_uint,
    pub sName: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_JLINKARM_JTAG_DEVICE_CONF() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_JTAG_DEVICE_CONF>(),
        24usize,
        concat!("Size of: ", stringify!(JLINKARM_JTAG_DEVICE_CONF))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_JTAG_DEVICE_CONF>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINKARM_JTAG_DEVICE_CONF))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_JTAG_DEVICE_CONF>())).SizeOfStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_JTAG_DEVICE_CONF),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_JTAG_DEVICE_CONF>())).IRLen as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_JTAG_DEVICE_CONF),
            "::",
            stringify!(IRLen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_JTAG_DEVICE_CONF>())).IRPrint as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_JTAG_DEVICE_CONF),
            "::",
            stringify!(IRPrint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_JTAG_DEVICE_CONF>())).Id as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_JTAG_DEVICE_CONF),
            "::",
            stringify!(Id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_JTAG_DEVICE_CONF>())).sName as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_JTAG_DEVICE_CONF),
            "::",
            stringify!(sName)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_JTAG_DEVICE_INFO {
    pub sName: *const ::std::os::raw::c_char,
    pub IRLen: ::std::os::raw::c_uint,
    pub IRPrint: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINKARM_JTAG_DEVICE_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_JTAG_DEVICE_INFO>(),
        16usize,
        concat!("Size of: ", stringify!(JLINKARM_JTAG_DEVICE_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_JTAG_DEVICE_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINKARM_JTAG_DEVICE_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_JTAG_DEVICE_INFO>())).sName as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_JTAG_DEVICE_INFO),
            "::",
            stringify!(sName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_JTAG_DEVICE_INFO>())).IRLen as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_JTAG_DEVICE_INFO),
            "::",
            stringify!(IRLen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_JTAG_DEVICE_INFO>())).IRPrint as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_JTAG_DEVICE_INFO),
            "::",
            stringify!(IRPrint)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_RTCK_REACT_INFO {
    pub SizeOfStruct: ::std::os::raw::c_uint,
    pub Min: ::std::os::raw::c_uint,
    pub Max: ::std::os::raw::c_uint,
    pub Average: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINKARM_RTCK_REACT_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_RTCK_REACT_INFO>(),
        16usize,
        concat!("Size of: ", stringify!(JLINKARM_RTCK_REACT_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_RTCK_REACT_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_RTCK_REACT_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_RTCK_REACT_INFO>())).SizeOfStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_RTCK_REACT_INFO),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_RTCK_REACT_INFO>())).Min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_RTCK_REACT_INFO),
            "::",
            stringify!(Min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_RTCK_REACT_INFO>())).Max as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_RTCK_REACT_INFO),
            "::",
            stringify!(Max)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_RTCK_REACT_INFO>())).Average as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_RTCK_REACT_INFO),
            "::",
            stringify!(Average)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_SPEED_INFO {
    pub SizeOfStruct: ::std::os::raw::c_uint,
    pub BaseFreq: ::std::os::raw::c_uint,
    pub MinDiv: ::std::os::raw::c_ushort,
    pub SupportAdaptive: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_JLINKARM_SPEED_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_SPEED_INFO>(),
        12usize,
        concat!("Size of: ", stringify!(JLINKARM_SPEED_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_SPEED_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_SPEED_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_SPEED_INFO>())).SizeOfStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SPEED_INFO),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_SPEED_INFO>())).BaseFreq as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SPEED_INFO),
            "::",
            stringify!(BaseFreq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_SPEED_INFO>())).MinDiv as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SPEED_INFO),
            "::",
            stringify!(MinDiv)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_SPEED_INFO>())).SupportAdaptive as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SPEED_INFO),
            "::",
            stringify!(SupportAdaptive)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_EMU_INFO {
    pub SizeOfStruct: ::std::os::raw::c_uint,
    pub USBAddr: ::std::os::raw::c_uint,
    pub SerialNo: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINKARM_EMU_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_EMU_INFO>(),
        12usize,
        concat!("Size of: ", stringify!(JLINKARM_EMU_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_EMU_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_EMU_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_EMU_INFO>())).SizeOfStruct as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_INFO),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_EMU_INFO>())).USBAddr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_INFO),
            "::",
            stringify!(USBAddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_EMU_INFO>())).SerialNo as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_INFO),
            "::",
            stringify!(SerialNo)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_EMU_CONNECT_INFO {
    pub SerialNumber: ::std::os::raw::c_uint,
    pub Connection: ::std::os::raw::c_uint,
    pub USBAddr: ::std::os::raw::c_uint,
    pub aIPAddr: [::std::os::raw::c_uchar; 16usize],
    pub Time: ::std::os::raw::c_int,
    pub Time_us: ::std::os::raw::c_ulonglong,
    pub HWVersion: ::std::os::raw::c_uint,
    pub abMACAddr: [::std::os::raw::c_uchar; 6usize],
    pub acProduct: [::std::os::raw::c_char; 32usize],
    pub acNickName: [::std::os::raw::c_char; 32usize],
    pub acFWString: [::std::os::raw::c_char; 112usize],
    pub IsDHCPAssignedIP: ::std::os::raw::c_char,
    pub IsDHCPAssignedIPIsValid: ::std::os::raw::c_char,
    pub NumIPConnections: ::std::os::raw::c_char,
    pub NumIPConnectionsIsValid: ::std::os::raw::c_char,
    pub aPadding: [::std::os::raw::c_uchar; 34usize],
}
#[test]
fn bindgen_test_layout_JLINKARM_EMU_CONNECT_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_EMU_CONNECT_INFO>(),
        264usize,
        concat!("Size of: ", stringify!(JLINKARM_EMU_CONNECT_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_EMU_CONNECT_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINKARM_EMU_CONNECT_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).SerialNumber as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(SerialNumber)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).Connection as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(Connection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).USBAddr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(USBAddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).aIPAddr as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(aIPAddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).Time as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(Time)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).Time_us as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(Time_us)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).HWVersion as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(HWVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).abMACAddr as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(abMACAddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).acProduct as *const _ as usize
        },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(acProduct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).acNickName as *const _ as usize
        },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(acNickName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).acFWString as *const _ as usize
        },
        114usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(acFWString)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).IsDHCPAssignedIP as *const _
                as usize
        },
        226usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(IsDHCPAssignedIP)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).IsDHCPAssignedIPIsValid
                as *const _ as usize
        },
        227usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(IsDHCPAssignedIPIsValid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).NumIPConnections as *const _
                as usize
        },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(NumIPConnections)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).NumIPConnectionsIsValid
                as *const _ as usize
        },
        229usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(NumIPConnectionsIsValid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_CONNECT_INFO>())).aPadding as *const _ as usize
        },
        230usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_CONNECT_INFO),
            "::",
            stringify!(aPadding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_EMU_CURR_CONNECT_INFO {
    pub HostIF: ::std::os::raw::c_uint,
    pub PortWEBS: ::std::os::raw::c_ushort,
    pub acPadding: [::std::os::raw::c_uchar; 250usize],
}
#[test]
fn bindgen_test_layout_JLINK_EMU_CURR_CONNECT_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_EMU_CURR_CONNECT_INFO>(),
        256usize,
        concat!("Size of: ", stringify!(JLINK_EMU_CURR_CONNECT_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_EMU_CURR_CONNECT_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_EMU_CURR_CONNECT_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_CURR_CONNECT_INFO>())).HostIF as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_CURR_CONNECT_INFO),
            "::",
            stringify!(HostIF)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_CURR_CONNECT_INFO>())).PortWEBS as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_CURR_CONNECT_INFO),
            "::",
            stringify!(PortWEBS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_CURR_CONNECT_INFO>())).acPadding as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_CURR_CONNECT_INFO),
            "::",
            stringify!(acPadding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_HW_STATUS {
    pub VTarget: ::std::os::raw::c_ushort,
    pub tck: ::std::os::raw::c_uchar,
    pub tdi: ::std::os::raw::c_uchar,
    pub tdo: ::std::os::raw::c_uchar,
    pub tms: ::std::os::raw::c_uchar,
    pub tres: ::std::os::raw::c_uchar,
    pub trst: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_JLINKARM_HW_STATUS() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_HW_STATUS>(),
        8usize,
        concat!("Size of: ", stringify!(JLINKARM_HW_STATUS))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_HW_STATUS>(),
        2usize,
        concat!("Alignment of ", stringify!(JLINKARM_HW_STATUS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_HW_STATUS>())).VTarget as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_HW_STATUS),
            "::",
            stringify!(VTarget)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_HW_STATUS>())).tck as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_HW_STATUS),
            "::",
            stringify!(tck)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_HW_STATUS>())).tdi as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_HW_STATUS),
            "::",
            stringify!(tdi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_HW_STATUS>())).tdo as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_HW_STATUS),
            "::",
            stringify!(tdo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_HW_STATUS>())).tms as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_HW_STATUS),
            "::",
            stringify!(tms)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_HW_STATUS>())).tres as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_HW_STATUS),
            "::",
            stringify!(tres)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_HW_STATUS>())).trst as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_HW_STATUS),
            "::",
            stringify!(trst)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_TRACE_DATA {
    pub PipeStat: ::std::os::raw::c_uchar,
    pub Sync: ::std::os::raw::c_uchar,
    pub Packet: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_JLINKARM_TRACE_DATA() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_TRACE_DATA>(),
        4usize,
        concat!("Size of: ", stringify!(JLINKARM_TRACE_DATA))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_TRACE_DATA>(),
        2usize,
        concat!("Alignment of ", stringify!(JLINKARM_TRACE_DATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_TRACE_DATA>())).PipeStat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_DATA),
            "::",
            stringify!(PipeStat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_TRACE_DATA>())).Sync as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_DATA),
            "::",
            stringify!(Sync)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_TRACE_DATA>())).Packet as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_DATA),
            "::",
            stringify!(Packet)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_TRACE_REGION_PROPS {
    pub SizeofStruct: ::std::os::raw::c_uint,
    pub RegionIndex: ::std::os::raw::c_uint,
    pub NumSamples: ::std::os::raw::c_uint,
    pub Off: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINKARM_TRACE_REGION_PROPS() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_TRACE_REGION_PROPS>(),
        16usize,
        concat!("Size of: ", stringify!(JLINKARM_TRACE_REGION_PROPS))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_TRACE_REGION_PROPS>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_TRACE_REGION_PROPS))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_TRACE_REGION_PROPS>())).SizeofStruct as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_REGION_PROPS),
            "::",
            stringify!(SizeofStruct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_TRACE_REGION_PROPS>())).RegionIndex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_REGION_PROPS),
            "::",
            stringify!(RegionIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_TRACE_REGION_PROPS>())).NumSamples as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_REGION_PROPS),
            "::",
            stringify!(NumSamples)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_TRACE_REGION_PROPS>())).Off as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_REGION_PROPS),
            "::",
            stringify!(Off)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_TRACE_REGION_PROPS_EX {
    pub SizeofStruct: ::std::os::raw::c_uint,
    pub RegionIndex: ::std::os::raw::c_uint,
    pub NumSamples: ::std::os::raw::c_uint,
    pub Off: ::std::os::raw::c_uint,
    pub RegionCnt: ::std::os::raw::c_uint,
    pub Dummy: ::std::os::raw::c_uint,
    pub TimeStamp: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_JLINKARM_TRACE_REGION_PROPS_EX() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_TRACE_REGION_PROPS_EX>(),
        32usize,
        concat!("Size of: ", stringify!(JLINKARM_TRACE_REGION_PROPS_EX))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_TRACE_REGION_PROPS_EX>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINKARM_TRACE_REGION_PROPS_EX))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_TRACE_REGION_PROPS_EX>())).SizeofStruct as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_REGION_PROPS_EX),
            "::",
            stringify!(SizeofStruct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_TRACE_REGION_PROPS_EX>())).RegionIndex as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_REGION_PROPS_EX),
            "::",
            stringify!(RegionIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_TRACE_REGION_PROPS_EX>())).NumSamples as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_REGION_PROPS_EX),
            "::",
            stringify!(NumSamples)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_TRACE_REGION_PROPS_EX>())).Off as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_REGION_PROPS_EX),
            "::",
            stringify!(Off)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_TRACE_REGION_PROPS_EX>())).RegionCnt as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_REGION_PROPS_EX),
            "::",
            stringify!(RegionCnt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_TRACE_REGION_PROPS_EX>())).Dummy as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_REGION_PROPS_EX),
            "::",
            stringify!(Dummy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_TRACE_REGION_PROPS_EX>())).TimeStamp as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_TRACE_REGION_PROPS_EX),
            "::",
            stringify!(TimeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_SWO_START_INFO {
    pub SizeofStruct: ::std::os::raw::c_uint,
    pub Interface: ::std::os::raw::c_uint,
    pub Speed: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINKARM_SWO_START_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_SWO_START_INFO>(),
        12usize,
        concat!("Size of: ", stringify!(JLINKARM_SWO_START_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_SWO_START_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_SWO_START_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_SWO_START_INFO>())).SizeofStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SWO_START_INFO),
            "::",
            stringify!(SizeofStruct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_SWO_START_INFO>())).Interface as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SWO_START_INFO),
            "::",
            stringify!(Interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_SWO_START_INFO>())).Speed as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SWO_START_INFO),
            "::",
            stringify!(Speed)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_SWO_SPEED_INFO {
    pub SizeofStruct: ::std::os::raw::c_uint,
    pub Interface: ::std::os::raw::c_uint,
    pub BaseFreq: ::std::os::raw::c_uint,
    pub MinDiv: ::std::os::raw::c_uint,
    pub MaxDiv: ::std::os::raw::c_uint,
    pub MinPrescale: ::std::os::raw::c_uint,
    pub MaxPrescale: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINKARM_SWO_SPEED_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_SWO_SPEED_INFO>(),
        28usize,
        concat!("Size of: ", stringify!(JLINKARM_SWO_SPEED_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_SWO_SPEED_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_SWO_SPEED_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_SWO_SPEED_INFO>())).SizeofStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SWO_SPEED_INFO),
            "::",
            stringify!(SizeofStruct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_SWO_SPEED_INFO>())).Interface as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SWO_SPEED_INFO),
            "::",
            stringify!(Interface)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_SWO_SPEED_INFO>())).BaseFreq as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SWO_SPEED_INFO),
            "::",
            stringify!(BaseFreq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_SWO_SPEED_INFO>())).MinDiv as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SWO_SPEED_INFO),
            "::",
            stringify!(MinDiv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_SWO_SPEED_INFO>())).MaxDiv as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SWO_SPEED_INFO),
            "::",
            stringify!(MaxDiv)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_SWO_SPEED_INFO>())).MinPrescale as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SWO_SPEED_INFO),
            "::",
            stringify!(MinPrescale)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_SWO_SPEED_INFO>())).MaxPrescale as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_SWO_SPEED_INFO),
            "::",
            stringify!(MaxPrescale)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_SPI_COMMAND_DESC {
    pub Command: ::std::os::raw::c_uint,
    pub pDataDown: *const ::std::os::raw::c_uchar,
    pub pDataUp: *mut ::std::os::raw::c_uchar,
    pub NumBits: ::std::os::raw::c_uint,
    pub Flags: ::std::os::raw::c_uint,
    pub pCmdArgs: *mut ::std::os::raw::c_uchar,
    pub NumBytesArgs: ::std::os::raw::c_uint,
    pub Result: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_JLINK_SPI_COMMAND_DESC() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_SPI_COMMAND_DESC>(),
        48usize,
        concat!("Size of: ", stringify!(JLINK_SPI_COMMAND_DESC))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_SPI_COMMAND_DESC>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINK_SPI_COMMAND_DESC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_SPI_COMMAND_DESC>())).Command as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_SPI_COMMAND_DESC),
            "::",
            stringify!(Command)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_SPI_COMMAND_DESC>())).pDataDown as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_SPI_COMMAND_DESC),
            "::",
            stringify!(pDataDown)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_SPI_COMMAND_DESC>())).pDataUp as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_SPI_COMMAND_DESC),
            "::",
            stringify!(pDataUp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_SPI_COMMAND_DESC>())).NumBits as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_SPI_COMMAND_DESC),
            "::",
            stringify!(NumBits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_SPI_COMMAND_DESC>())).Flags as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_SPI_COMMAND_DESC),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_SPI_COMMAND_DESC>())).pCmdArgs as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_SPI_COMMAND_DESC),
            "::",
            stringify!(pCmdArgs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_SPI_COMMAND_DESC>())).NumBytesArgs as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_SPI_COMMAND_DESC),
            "::",
            stringify!(NumBytesArgs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_SPI_COMMAND_DESC>())).Result as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_SPI_COMMAND_DESC),
            "::",
            stringify!(Result)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_WRITE_MEM_DESC {
    pub Addr: ::std::os::raw::c_uint,
    pub NumBytes: ::std::os::raw::c_uint,
    pub pData: *mut ::std::os::raw::c_uchar,
    pub pStatus: *mut ::std::os::raw::c_uchar,
    pub AccessWidth: ::std::os::raw::c_uint,
    pub Flags: ::std::os::raw::c_uint,
    pub Result: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_JLINK_WRITE_MEM_DESC() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_WRITE_MEM_DESC>(),
        40usize,
        concat!("Size of: ", stringify!(JLINK_WRITE_MEM_DESC))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_WRITE_MEM_DESC>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINK_WRITE_MEM_DESC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_WRITE_MEM_DESC>())).Addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_WRITE_MEM_DESC),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_WRITE_MEM_DESC>())).NumBytes as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_WRITE_MEM_DESC),
            "::",
            stringify!(NumBytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_WRITE_MEM_DESC>())).pData as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_WRITE_MEM_DESC),
            "::",
            stringify!(pData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_WRITE_MEM_DESC>())).pStatus as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_WRITE_MEM_DESC),
            "::",
            stringify!(pStatus)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_WRITE_MEM_DESC>())).AccessWidth as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_WRITE_MEM_DESC),
            "::",
            stringify!(AccessWidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_WRITE_MEM_DESC>())).Flags as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_WRITE_MEM_DESC),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_WRITE_MEM_DESC>())).Result as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_WRITE_MEM_DESC),
            "::",
            stringify!(Result)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_CORESIGHT_APDP_ACC_DESC {
    pub Data: ::std::os::raw::c_uint,
    pub Mask: ::std::os::raw::c_uint,
    pub CompVal: ::std::os::raw::c_uint,
    pub Status: ::std::os::raw::c_int,
    pub TimeoutMsReadUntil: ::std::os::raw::c_int,
    pub RegIndex: ::std::os::raw::c_uchar,
    pub APnDP: ::std::os::raw::c_uchar,
    pub RnW: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_JLINK_CORESIGHT_APDP_ACC_DESC() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_CORESIGHT_APDP_ACC_DESC>(),
        24usize,
        concat!("Size of: ", stringify!(JLINK_CORESIGHT_APDP_ACC_DESC))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_CORESIGHT_APDP_ACC_DESC>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_CORESIGHT_APDP_ACC_DESC))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_CORESIGHT_APDP_ACC_DESC>())).Data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_CORESIGHT_APDP_ACC_DESC),
            "::",
            stringify!(Data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_CORESIGHT_APDP_ACC_DESC>())).Mask as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_CORESIGHT_APDP_ACC_DESC),
            "::",
            stringify!(Mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_CORESIGHT_APDP_ACC_DESC>())).CompVal as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_CORESIGHT_APDP_ACC_DESC),
            "::",
            stringify!(CompVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_CORESIGHT_APDP_ACC_DESC>())).Status as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_CORESIGHT_APDP_ACC_DESC),
            "::",
            stringify!(Status)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_CORESIGHT_APDP_ACC_DESC>())).TimeoutMsReadUntil as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_CORESIGHT_APDP_ACC_DESC),
            "::",
            stringify!(TimeoutMsReadUntil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_CORESIGHT_APDP_ACC_DESC>())).RegIndex as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_CORESIGHT_APDP_ACC_DESC),
            "::",
            stringify!(RegIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_CORESIGHT_APDP_ACC_DESC>())).APnDP as *const _ as usize
        },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_CORESIGHT_APDP_ACC_DESC),
            "::",
            stringify!(APnDP)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_CORESIGHT_APDP_ACC_DESC>())).RnW as *const _ as usize
        },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_CORESIGHT_APDP_ACC_DESC),
            "::",
            stringify!(RnW)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_POWERTRACE_DATA_ITEM {
    pub RefValue: ::std::os::raw::c_uint,
    pub Data: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_POWERTRACE_DATA_ITEM() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_POWERTRACE_DATA_ITEM>(),
        8usize,
        concat!("Size of: ", stringify!(JLINK_POWERTRACE_DATA_ITEM))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_POWERTRACE_DATA_ITEM>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_POWERTRACE_DATA_ITEM))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_DATA_ITEM>())).RefValue as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_DATA_ITEM),
            "::",
            stringify!(RefValue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_POWERTRACE_DATA_ITEM>())).Data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_DATA_ITEM),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_POWERTRACE_SETUP {
    pub SizeOfStruct: ::std::os::raw::c_int,
    pub ChannelMask: ::std::os::raw::c_uint,
    pub SampleFreq: ::std::os::raw::c_uint,
    pub RefSelect: ::std::os::raw::c_int,
    pub EnableCond: ::std::os::raw::c_int,
    pub Flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_POWERTRACE_SETUP() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_POWERTRACE_SETUP>(),
        24usize,
        concat!("Size of: ", stringify!(JLINK_POWERTRACE_SETUP))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_POWERTRACE_SETUP>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_POWERTRACE_SETUP))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_SETUP>())).SizeOfStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_SETUP),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_SETUP>())).ChannelMask as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_SETUP),
            "::",
            stringify!(ChannelMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_SETUP>())).SampleFreq as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_SETUP),
            "::",
            stringify!(SampleFreq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_SETUP>())).RefSelect as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_SETUP),
            "::",
            stringify!(RefSelect)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_SETUP>())).EnableCond as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_SETUP),
            "::",
            stringify!(EnableCond)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_POWERTRACE_SETUP>())).Flags as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_SETUP),
            "::",
            stringify!(Flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_POWERTRACE_CAPS {
    pub SizeOfStruct: ::std::os::raw::c_int,
    pub ChannelMask: ::std::os::raw::c_uint,
    pub Flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_POWERTRACE_CAPS() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_POWERTRACE_CAPS>(),
        12usize,
        concat!("Size of: ", stringify!(JLINK_POWERTRACE_CAPS))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_POWERTRACE_CAPS>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_POWERTRACE_CAPS))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_CAPS>())).SizeOfStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_CAPS),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_CAPS>())).ChannelMask as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_CAPS),
            "::",
            stringify!(ChannelMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_POWERTRACE_CAPS>())).Flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_CAPS),
            "::",
            stringify!(Flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_POWERTRACE_CHANNEL_CAPS_OUT {
    pub SizeOfStruct: ::std::os::raw::c_int,
    pub BaseFreq: ::std::os::raw::c_uint,
    pub MinDiv: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_POWERTRACE_CHANNEL_CAPS_OUT() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_POWERTRACE_CHANNEL_CAPS_OUT>(),
        12usize,
        concat!("Size of: ", stringify!(JLINK_POWERTRACE_CHANNEL_CAPS_OUT))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_POWERTRACE_CHANNEL_CAPS_OUT>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(JLINK_POWERTRACE_CHANNEL_CAPS_OUT)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_CHANNEL_CAPS_OUT>())).SizeOfStruct as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_CHANNEL_CAPS_OUT),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_CHANNEL_CAPS_OUT>())).BaseFreq as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_CHANNEL_CAPS_OUT),
            "::",
            stringify!(BaseFreq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_CHANNEL_CAPS_OUT>())).MinDiv as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_CHANNEL_CAPS_OUT),
            "::",
            stringify!(MinDiv)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_POWERTRACE_CHANNEL_CAPS_IN {
    pub SizeOfStruct: ::std::os::raw::c_int,
    pub ChannelMask: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_POWERTRACE_CHANNEL_CAPS_IN() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_POWERTRACE_CHANNEL_CAPS_IN>(),
        8usize,
        concat!("Size of: ", stringify!(JLINK_POWERTRACE_CHANNEL_CAPS_IN))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_POWERTRACE_CHANNEL_CAPS_IN>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(JLINK_POWERTRACE_CHANNEL_CAPS_IN)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_CHANNEL_CAPS_IN>())).SizeOfStruct as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_CHANNEL_CAPS_IN),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_POWERTRACE_CHANNEL_CAPS_IN>())).ChannelMask as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_POWERTRACE_CHANNEL_CAPS_IN),
            "::",
            stringify!(ChannelMask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_RTTERMINAL_START {
    pub ConfigBlockAddress: ::std::os::raw::c_uint,
    pub Dummy0: ::std::os::raw::c_uint,
    pub Dummy1: ::std::os::raw::c_uint,
    pub Dummy2: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_RTTERMINAL_START() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_RTTERMINAL_START>(),
        16usize,
        concat!("Size of: ", stringify!(JLINK_RTTERMINAL_START))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_RTTERMINAL_START>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_RTTERMINAL_START))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_START>())).ConfigBlockAddress as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_START),
            "::",
            stringify!(ConfigBlockAddress)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RTTERMINAL_START>())).Dummy0 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_START),
            "::",
            stringify!(Dummy0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RTTERMINAL_START>())).Dummy1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_START),
            "::",
            stringify!(Dummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RTTERMINAL_START>())).Dummy2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_START),
            "::",
            stringify!(Dummy2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_RTTERMINAL_STOP {
    pub InvalidateTargetCB: ::std::os::raw::c_uchar,
    pub acDummy: [::std::os::raw::c_uchar; 3usize],
    pub Dummy0: ::std::os::raw::c_uint,
    pub Dummy1: ::std::os::raw::c_uint,
    pub Dummy2: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_RTTERMINAL_STOP() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_RTTERMINAL_STOP>(),
        16usize,
        concat!("Size of: ", stringify!(JLINK_RTTERMINAL_STOP))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_RTTERMINAL_STOP>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_RTTERMINAL_STOP))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_STOP>())).InvalidateTargetCB as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STOP),
            "::",
            stringify!(InvalidateTargetCB)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RTTERMINAL_STOP>())).acDummy as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STOP),
            "::",
            stringify!(acDummy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RTTERMINAL_STOP>())).Dummy0 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STOP),
            "::",
            stringify!(Dummy0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RTTERMINAL_STOP>())).Dummy1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STOP),
            "::",
            stringify!(Dummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RTTERMINAL_STOP>())).Dummy2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STOP),
            "::",
            stringify!(Dummy2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_RTTERMINAL_BUFDESC {
    pub BufferIndex: ::std::os::raw::c_int,
    pub Direction: ::std::os::raw::c_uint,
    pub acName: [::std::os::raw::c_char; 32usize],
    pub SizeOfBuffer: ::std::os::raw::c_uint,
    pub Flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_RTTERMINAL_BUFDESC() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_RTTERMINAL_BUFDESC>(),
        48usize,
        concat!("Size of: ", stringify!(JLINK_RTTERMINAL_BUFDESC))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_RTTERMINAL_BUFDESC>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_RTTERMINAL_BUFDESC))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_BUFDESC>())).BufferIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_BUFDESC),
            "::",
            stringify!(BufferIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_BUFDESC>())).Direction as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_BUFDESC),
            "::",
            stringify!(Direction)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RTTERMINAL_BUFDESC>())).acName as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_BUFDESC),
            "::",
            stringify!(acName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_BUFDESC>())).SizeOfBuffer as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_BUFDESC),
            "::",
            stringify!(SizeOfBuffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RTTERMINAL_BUFDESC>())).Flags as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_BUFDESC),
            "::",
            stringify!(Flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_RTTERMINAL_STATUS {
    pub NumBytesTransferred: ::std::os::raw::c_uint,
    pub NumBytesRead: ::std::os::raw::c_uint,
    pub HostOverflowCount: ::std::os::raw::c_int,
    pub IsRunning: ::std::os::raw::c_int,
    pub NumUpBuffers: ::std::os::raw::c_int,
    pub NumDownBuffers: ::std::os::raw::c_int,
    pub OverflowMask: ::std::os::raw::c_uint,
    pub Dummy1: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_RTTERMINAL_STATUS() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_RTTERMINAL_STATUS>(),
        32usize,
        concat!("Size of: ", stringify!(JLINK_RTTERMINAL_STATUS))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_RTTERMINAL_STATUS>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_RTTERMINAL_STATUS))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_STATUS>())).NumBytesTransferred as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STATUS),
            "::",
            stringify!(NumBytesTransferred)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_STATUS>())).NumBytesRead as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STATUS),
            "::",
            stringify!(NumBytesRead)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_STATUS>())).HostOverflowCount as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STATUS),
            "::",
            stringify!(HostOverflowCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_STATUS>())).IsRunning as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STATUS),
            "::",
            stringify!(IsRunning)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_STATUS>())).NumUpBuffers as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STATUS),
            "::",
            stringify!(NumUpBuffers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_STATUS>())).NumDownBuffers as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STATUS),
            "::",
            stringify!(NumDownBuffers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RTTERMINAL_STATUS>())).OverflowMask as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STATUS),
            "::",
            stringify!(OverflowMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_RTTERMINAL_STATUS>())).Dummy1 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RTTERMINAL_STATUS),
            "::",
            stringify!(Dummy1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_HSS_MEM_BLOCK_DESC {
    pub Addr: ::std::os::raw::c_uint,
    pub NumBytes: ::std::os::raw::c_uint,
    pub Flags: ::std::os::raw::c_uint,
    pub Dummy: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_HSS_MEM_BLOCK_DESC() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_HSS_MEM_BLOCK_DESC>(),
        16usize,
        concat!("Size of: ", stringify!(JLINK_HSS_MEM_BLOCK_DESC))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_HSS_MEM_BLOCK_DESC>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_HSS_MEM_BLOCK_DESC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_HSS_MEM_BLOCK_DESC>())).Addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_HSS_MEM_BLOCK_DESC),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_HSS_MEM_BLOCK_DESC>())).NumBytes as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_HSS_MEM_BLOCK_DESC),
            "::",
            stringify!(NumBytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_HSS_MEM_BLOCK_DESC>())).Flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_HSS_MEM_BLOCK_DESC),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_HSS_MEM_BLOCK_DESC>())).Dummy as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_HSS_MEM_BLOCK_DESC),
            "::",
            stringify!(Dummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_HSS_CAPS {
    pub MaxBlocks: ::std::os::raw::c_uint,
    pub MaxFreq: ::std::os::raw::c_uint,
    pub Caps: ::std::os::raw::c_uint,
    pub aDummy: [::std::os::raw::c_uint; 5usize],
}
#[test]
fn bindgen_test_layout_JLINK_HSS_CAPS() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_HSS_CAPS>(),
        32usize,
        concat!("Size of: ", stringify!(JLINK_HSS_CAPS))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_HSS_CAPS>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_HSS_CAPS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_HSS_CAPS>())).MaxBlocks as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_HSS_CAPS),
            "::",
            stringify!(MaxBlocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_HSS_CAPS>())).MaxFreq as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_HSS_CAPS),
            "::",
            stringify!(MaxFreq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_HSS_CAPS>())).Caps as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_HSS_CAPS),
            "::",
            stringify!(Caps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_HSS_CAPS>())).aDummy as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_HSS_CAPS),
            "::",
            stringify!(aDummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_EMU_GPIO_DESC {
    pub acName: [::std::os::raw::c_char; 32usize],
    pub Caps: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_EMU_GPIO_DESC() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_EMU_GPIO_DESC>(),
        36usize,
        concat!("Size of: ", stringify!(JLINK_EMU_GPIO_DESC))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_EMU_GPIO_DESC>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_EMU_GPIO_DESC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_EMU_GPIO_DESC>())).acName as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_GPIO_DESC),
            "::",
            stringify!(acName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_EMU_GPIO_DESC>())).Caps as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_GPIO_DESC),
            "::",
            stringify!(Caps)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_EMU_PCODE_STATUS_INFO {
    pub PCodeStat: ::std::os::raw::c_uint,
    pub S32_PC: ::std::os::raw::c_uint,
    pub S32_R0: ::std::os::raw::c_uint,
    pub S32_SP: ::std::os::raw::c_uint,
    pub S32_StatusReg: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINKARM_EMU_PCODE_STATUS_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_EMU_PCODE_STATUS_INFO>(),
        20usize,
        concat!("Size of: ", stringify!(JLINKARM_EMU_PCODE_STATUS_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_EMU_PCODE_STATUS_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_EMU_PCODE_STATUS_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_PCODE_STATUS_INFO>())).PCodeStat as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_PCODE_STATUS_INFO),
            "::",
            stringify!(PCodeStat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_PCODE_STATUS_INFO>())).S32_PC as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_PCODE_STATUS_INFO),
            "::",
            stringify!(S32_PC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_PCODE_STATUS_INFO>())).S32_R0 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_PCODE_STATUS_INFO),
            "::",
            stringify!(S32_R0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_PCODE_STATUS_INFO>())).S32_SP as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_PCODE_STATUS_INFO),
            "::",
            stringify!(S32_SP)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_EMU_PCODE_STATUS_INFO>())).S32_StatusReg as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_EMU_PCODE_STATUS_INFO),
            "::",
            stringify!(S32_StatusReg)
        )
    );
}
pub const JLINKARM_FLASH_EVENT_JLINKARM_FLASH_EVENT_ERASE: JLINKARM_FLASH_EVENT = 0;
pub const JLINKARM_FLASH_EVENT_JLINKARM_FLASH_EVENT_PROGRAM: JLINKARM_FLASH_EVENT = 1;
pub const JLINKARM_FLASH_EVENT_JLINKARM_FLASH_EVENT_VERIFY: JLINKARM_FLASH_EVENT = 2;
pub type JLINKARM_FLASH_EVENT = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_FLASH_NOTIFY_INFO {
    pub SizeofStruct: ::std::os::raw::c_uint,
    pub Addr: ::std::os::raw::c_uint,
    pub NumBytesTotal: ::std::os::raw::c_uint,
    pub NumBytesCurrent: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINKARM_FLASH_NOTIFY_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_FLASH_NOTIFY_INFO>(),
        16usize,
        concat!("Size of: ", stringify!(JLINKARM_FLASH_NOTIFY_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_FLASH_NOTIFY_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINKARM_FLASH_NOTIFY_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_FLASH_NOTIFY_INFO>())).SizeofStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_FLASH_NOTIFY_INFO),
            "::",
            stringify!(SizeofStruct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_FLASH_NOTIFY_INFO>())).Addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_FLASH_NOTIFY_INFO),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_FLASH_NOTIFY_INFO>())).NumBytesTotal as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_FLASH_NOTIFY_INFO),
            "::",
            stringify!(NumBytesTotal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINKARM_FLASH_NOTIFY_INFO>())).NumBytesCurrent as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_FLASH_NOTIFY_INFO),
            "::",
            stringify!(NumBytesCurrent)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_MEM_ZONE_INFO {
    pub sName: *const ::std::os::raw::c_char,
    pub sDesc: *const ::std::os::raw::c_char,
    pub VirtAddr: ::std::os::raw::c_ulonglong,
    pub abDummy: [::std::os::raw::c_uchar; 16usize],
}
#[test]
fn bindgen_test_layout_JLINK_MEM_ZONE_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_MEM_ZONE_INFO>(),
        40usize,
        concat!("Size of: ", stringify!(JLINK_MEM_ZONE_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_MEM_ZONE_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINK_MEM_ZONE_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_MEM_ZONE_INFO>())).sName as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_MEM_ZONE_INFO),
            "::",
            stringify!(sName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_MEM_ZONE_INFO>())).sDesc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_MEM_ZONE_INFO),
            "::",
            stringify!(sDesc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_MEM_ZONE_INFO>())).VirtAddr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_MEM_ZONE_INFO),
            "::",
            stringify!(VirtAddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_MEM_ZONE_INFO>())).abDummy as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_MEM_ZONE_INFO),
            "::",
            stringify!(abDummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_DISASSEMBLY_INFO {
    pub SizeOfStruct: ::std::os::raw::c_uint,
    pub Mode: ::std::os::raw::c_uchar,
    pub Condition: ::std::os::raw::c_uchar,
    pub aDummy: [::std::os::raw::c_uchar; 2usize],
}
#[test]
fn bindgen_test_layout_JLINK_DISASSEMBLY_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_DISASSEMBLY_INFO>(),
        8usize,
        concat!("Size of: ", stringify!(JLINK_DISASSEMBLY_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_DISASSEMBLY_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_DISASSEMBLY_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INFO>())).SizeOfStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INFO),
            "::",
            stringify!(SizeOfStruct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INFO>())).Mode as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INFO),
            "::",
            stringify!(Mode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INFO>())).Condition as *const _ as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INFO),
            "::",
            stringify!(Condition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INFO>())).aDummy as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INFO),
            "::",
            stringify!(aDummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_DISASSEMBLY_INST_INFO {
    pub Size: ::std::os::raw::c_uchar,
    pub IsBranch: ::std::os::raw::c_uchar,
    pub IsCall: ::std::os::raw::c_uchar,
    pub IsMemAccess: ::std::os::raw::c_uchar,
    pub IsFixedAddr: ::std::os::raw::c_uchar,
    pub IsConditional: ::std::os::raw::c_uchar,
    pub ITBlock: ::std::os::raw::c_uchar,
    pub abAddr: [::std::os::raw::c_uchar; 8usize],
    pub aDummy: [::std::os::raw::c_uchar; 1usize],
}
#[test]
fn bindgen_test_layout_JLINK_DISASSEMBLY_INST_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_DISASSEMBLY_INST_INFO>(),
        16usize,
        concat!("Size of: ", stringify!(JLINK_DISASSEMBLY_INST_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_DISASSEMBLY_INST_INFO>(),
        1usize,
        concat!("Alignment of ", stringify!(JLINK_DISASSEMBLY_INST_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INST_INFO>())).Size as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INST_INFO),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INST_INFO>())).IsBranch as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INST_INFO),
            "::",
            stringify!(IsBranch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INST_INFO>())).IsCall as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INST_INFO),
            "::",
            stringify!(IsCall)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INST_INFO>())).IsMemAccess as *const _ as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INST_INFO),
            "::",
            stringify!(IsMemAccess)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INST_INFO>())).IsFixedAddr as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INST_INFO),
            "::",
            stringify!(IsFixedAddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INST_INFO>())).IsConditional as *const _
                as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INST_INFO),
            "::",
            stringify!(IsConditional)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INST_INFO>())).ITBlock as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INST_INFO),
            "::",
            stringify!(ITBlock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INST_INFO>())).abAddr as *const _ as usize
        },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INST_INFO),
            "::",
            stringify!(abAddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_DISASSEMBLY_INST_INFO>())).aDummy as *const _ as usize
        },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_DISASSEMBLY_INST_INFO),
            "::",
            stringify!(aDummy)
        )
    );
}
pub type JLINK_DISASSEMBLY_FUNC_GET_INST_INFO = ::std::option::Option<
    unsafe extern "C" fn(
        pInfoOut: *mut JLINK_DISASSEMBLY_INST_INFO,
        pData: *const ::std::os::raw::c_uchar,
        NumBytes: ::std::os::raw::c_uint,
        CPUMode: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_DISASSEMBLY_FUNC_DISASSEMBLE_BUFFER = ::std::option::Option<
    unsafe extern "C" fn(
        pInst: *mut ::std::os::raw::c_char,
        InstSize: ::std::os::raw::c_uint,
        pBuffer: *const ::std::os::raw::c_void,
        BufferSize: ::std::os::raw::c_uint,
        Addr: ::std::os::raw::c_uint,
        CPUMode: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_RAWTRACE_BIST_ERR_BUF_DESC {
    pub FailAddr: ::std::os::raw::c_uint,
    pub DataExpected: ::std::os::raw::c_uint,
    pub DataRead: ::std::os::raw::c_uint,
    pub DataReRead: ::std::os::raw::c_uint,
    pub aReserved: [::std::os::raw::c_uint; 4usize],
}
#[test]
fn bindgen_test_layout_JLINK_RAWTRACE_BIST_ERR_BUF_DESC() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_RAWTRACE_BIST_ERR_BUF_DESC>(),
        32usize,
        concat!("Size of: ", stringify!(JLINK_RAWTRACE_BIST_ERR_BUF_DESC))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_RAWTRACE_BIST_ERR_BUF_DESC>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(JLINK_RAWTRACE_BIST_ERR_BUF_DESC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RAWTRACE_BIST_ERR_BUF_DESC>())).FailAddr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RAWTRACE_BIST_ERR_BUF_DESC),
            "::",
            stringify!(FailAddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RAWTRACE_BIST_ERR_BUF_DESC>())).DataExpected as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RAWTRACE_BIST_ERR_BUF_DESC),
            "::",
            stringify!(DataExpected)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RAWTRACE_BIST_ERR_BUF_DESC>())).DataRead as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RAWTRACE_BIST_ERR_BUF_DESC),
            "::",
            stringify!(DataRead)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RAWTRACE_BIST_ERR_BUF_DESC>())).DataReRead as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RAWTRACE_BIST_ERR_BUF_DESC),
            "::",
            stringify!(DataReRead)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_RAWTRACE_BIST_ERR_BUF_DESC>())).aReserved as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_RAWTRACE_BIST_ERR_BUF_DESC),
            "::",
            stringify!(aReserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_EMU_TARGET_IMG_AREA_INFO {
    pub Size: ::std::os::raw::c_uint,
    pub SectorSizeShift: ::std::os::raw::c_uchar,
    pub MinAlignShift: ::std::os::raw::c_uchar,
    pub Dummy0: ::std::os::raw::c_uchar,
    pub Dummy1: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_JLINK_EMU_TARGET_IMG_AREA_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_EMU_TARGET_IMG_AREA_INFO>(),
        8usize,
        concat!("Size of: ", stringify!(JLINK_EMU_TARGET_IMG_AREA_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_EMU_TARGET_IMG_AREA_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_EMU_TARGET_IMG_AREA_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_TARGET_IMG_AREA_INFO>())).Size as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_TARGET_IMG_AREA_INFO),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_TARGET_IMG_AREA_INFO>())).SectorSizeShift as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_TARGET_IMG_AREA_INFO),
            "::",
            stringify!(SectorSizeShift)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_TARGET_IMG_AREA_INFO>())).MinAlignShift as *const _
                as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_TARGET_IMG_AREA_INFO),
            "::",
            stringify!(MinAlignShift)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_TARGET_IMG_AREA_INFO>())).Dummy0 as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_TARGET_IMG_AREA_INFO),
            "::",
            stringify!(Dummy0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_TARGET_IMG_AREA_INFO>())).Dummy1 as *const _ as usize
        },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_TARGET_IMG_AREA_INFO),
            "::",
            stringify!(Dummy1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_STRACE_TIMESTAMP_INFO {
    pub Time: ::std::os::raw::c_ulonglong,
    pub Index: ::std::os::raw::c_uint,
    pub Flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_STRACE_TIMESTAMP_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_STRACE_TIMESTAMP_INFO>(),
        16usize,
        concat!("Size of: ", stringify!(JLINK_STRACE_TIMESTAMP_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_STRACE_TIMESTAMP_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINK_STRACE_TIMESTAMP_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_STRACE_TIMESTAMP_INFO>())).Time as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_TIMESTAMP_INFO),
            "::",
            stringify!(Time)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_STRACE_TIMESTAMP_INFO>())).Index as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_TIMESTAMP_INFO),
            "::",
            stringify!(Index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_STRACE_TIMESTAMP_INFO>())).Flags as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_STRACE_TIMESTAMP_INFO),
            "::",
            stringify!(Flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINK_EMU_FILE_VOLUME_INFO {
    pub SizeofStruct: ::std::os::raw::c_uint,
    pub VolumeSizeLo: ::std::os::raw::c_uint,
    pub VolumeSizeHi: ::std::os::raw::c_uint,
    pub NumBytesUsedLo: ::std::os::raw::c_uint,
    pub NumBytesUsedHi: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINK_EMU_FILE_VOLUME_INFO() {
    assert_eq!(
        ::std::mem::size_of::<JLINK_EMU_FILE_VOLUME_INFO>(),
        20usize,
        concat!("Size of: ", stringify!(JLINK_EMU_FILE_VOLUME_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINK_EMU_FILE_VOLUME_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(JLINK_EMU_FILE_VOLUME_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_FILE_VOLUME_INFO>())).SizeofStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_FILE_VOLUME_INFO),
            "::",
            stringify!(SizeofStruct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_FILE_VOLUME_INFO>())).VolumeSizeLo as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_FILE_VOLUME_INFO),
            "::",
            stringify!(VolumeSizeLo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_FILE_VOLUME_INFO>())).VolumeSizeHi as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_FILE_VOLUME_INFO),
            "::",
            stringify!(VolumeSizeHi)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_FILE_VOLUME_INFO>())).NumBytesUsedLo as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_FILE_VOLUME_INFO),
            "::",
            stringify!(NumBytesUsedLo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<JLINK_EMU_FILE_VOLUME_INFO>())).NumBytesUsedHi as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINK_EMU_FILE_VOLUME_INFO),
            "::",
            stringify!(NumBytesUsedHi)
        )
    );
}
pub type BANK_HANDLE = ::std::os::raw::c_uint;
pub type DATA_FILE_HANDLE = ::std::os::raw::c_uint;
pub type JLINK_FLASH_PROGRESS_CB_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        sAction: *const ::std::os::raw::c_char,
        sProg: *const ::std::os::raw::c_char,
        Percentage: ::std::os::raw::c_int,
    ),
>;
pub type JLINK_LOG =
    ::std::option::Option<unsafe extern "C" fn(sErr: *const ::std::os::raw::c_char)>;
pub type JLINKARM_LOG =
    ::std::option::Option<unsafe extern "C" fn(sErr: *const ::std::os::raw::c_char)>;
pub type JLINKARM_FLASH_NOTIFY_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        Event: JLINKARM_FLASH_EVENT,
        pNotifyInfo: *const JLINKARM_FLASH_NOTIFY_INFO,
    ),
>;
pub type JLINKARM_WAIT_FUNC = ::std::option::Option<
    unsafe extern "C" fn(pContext: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type JLINK_HOOK_DIALOG_UNSECURE = ::std::option::Option<
    unsafe extern "C" fn(
        sTitle: *const ::std::os::raw::c_char,
        sMsg: *const ::std::os::raw::c_char,
        Flags: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_HOOK_DIALOG_UNLOCK_IDCODE = ::std::option::Option<
    unsafe extern "C" fn(
        sTitle: *const ::std::os::raw::c_char,
        sMsg: *const ::std::os::raw::c_char,
        Flags: ::std::os::raw::c_uint,
        pIDCODE: *mut ::std::os::raw::c_void,
        MaxNumBytesIDCODE: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_SET_HOOK_DIALOG_UNLOCK_IDCODE: JLINK_FUNC_INDEX = 0;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_SPI_TRANSFER_MULTIPLE: JLINK_FUNC_INDEX = 1;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_PIN_OVERRIDE: JLINK_FUNC_INDEX = 2;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_PIN_OVERRIDE_GET_PIN_CAPS: JLINK_FUNC_INDEX = 3;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_MRU_GETLIST: JLINK_FUNC_INDEX = 4;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_RESERVED3: JLINK_FUNC_INDEX = 5;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_RESERVED4: JLINK_FUNC_INDEX = 6;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_RESERVED5: JLINK_FUNC_INDEX = 7;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_GET_SESSION_ID: JLINK_FUNC_INDEX = 8;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_CORESIGHT_TRIGGER_READ_APDP_REG: JLINK_FUNC_INDEX = 9;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_CAN_ACC_MEM_WHILE_RUNNING: JLINK_FUNC_INDEX = 10;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_UPDATE_BTL: JLINK_FUNC_INDEX = 11;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_GET_CURRENT_ENDIANESS: JLINK_FUNC_INDEX = 12;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_ALGODB_GET_PALGO_INFO: JLINK_FUNC_INDEX = 13;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_ALGODB_GET_PALGO_INFO_CFI: JLINK_FUNC_INDEX = 14;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_ALGODB_GET_ALGO_NO: JLINK_FUNC_INDEX = 15;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_PCODE_SET_ENTRY_FUNC: JLINK_FUNC_INDEX = 16;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_PCODE_DOWNLOAD: JLINK_FUNC_INDEX = 17;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_PCODE_EXEC_EX: JLINK_FUNC_INDEX = 18;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_START_MERGE_COMMANDS: JLINK_FUNC_INDEX = 19;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_END_MERGE_COMMANDS: JLINK_FUNC_INDEX = 20;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_RAWTRACE_BIST_STARTSTOP: JLINK_FUNC_INDEX = 21;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_RAWTRACE_BIST_READ_ERR_STATS: JLINK_FUNC_INDEX = 22;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_GET_PF_GET_INST_INFO: JLINK_FUNC_INDEX = 23;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_CORESIGHT_ACC_APDP_REG_MUL: JLINK_FUNC_INDEX = 24;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_PCODE_DATA_DOWNLOAD: JLINK_FUNC_INDEX = 25;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_PCODE_EXEC_EX2: JLINK_FUNC_INDEX = 26;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_PCODE_FREE: JLINK_FUNC_INDEX = 27;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_EMU_COMMANDLINE_WRITE_READ: JLINK_FUNC_INDEX = 28;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_GET_PF_DISASSEMBLE_BUFFER: JLINK_FUNC_INDEX = 29;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_EMU_GET_TARGET_IMG_AREA_INFO: JLINK_FUNC_INDEX = 30;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_EMU_READ_TARGET_IMG_AREA: JLINK_FUNC_INDEX = 31;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_EMU_WRITE_TARGET_IMG_AREA: JLINK_FUNC_INDEX = 32;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_EMU_GET_CURR_CONN_INFO: JLINK_FUNC_INDEX = 33;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_GET_PF_EXP_DEVICE_LIST_XML: JLINK_FUNC_INDEX = 34;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_SCRIPTFILE_EXEC_FUNC: JLINK_FUNC_INDEX = 35;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_EMU_ADD_FW_IMAGES: JLINK_FUNC_INDEX = 36;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_READ_CSR: JLINK_FUNC_INDEX = 37;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_WRITE_CSR: JLINK_FUNC_INDEX = 38;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_EMU_FILE_GET_VOLUME_INFO: JLINK_FUNC_INDEX = 39;
pub const JLINK_FUNC_INDEX_JLINK_IFUNC_ERASE: JLINK_FUNC_INDEX = 40;
pub const JLINK_FUNC_INDEX_JLINK_NUM_FUNC_INDEXES: JLINK_FUNC_INDEX = 41;
pub type JLINK_FUNC_INDEX = ::std::os::raw::c_uint;
pub type JLINK_FUNC_SET_HOOK_DIALOG_UNLOCK_IDCODE = ::std::option::Option<
    unsafe extern "C" fn(pfHook: JLINK_HOOK_DIALOG_UNLOCK_IDCODE) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_SPI_TRANSFER_MULTIPLE = ::std::option::Option<
    unsafe extern "C" fn(
        paDesc: *mut JLINK_SPI_COMMAND_DESC,
        NumCommands: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_MRU_GETLIST = ::std::option::Option<
    unsafe extern "C" fn(
        Group: ::std::os::raw::c_uint,
        sList: *mut ::std::os::raw::c_char,
        BufferSize: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_PIN_OVERRIDE = ::std::option::Option<
    unsafe extern "C" fn(
        paMode: *const ::std::os::raw::c_uint,
        paState: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_PIN_OVERRIDE_GET_PIN_CAPS = ::std::option::Option<
    unsafe extern "C" fn(paCaps: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_GET_SESSION_ID =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
pub type JLINK_FUNC_CORESIGHT_TRIGGER_READ_APDP_REG = ::std::option::Option<
    unsafe extern "C" fn(
        RegIndex: ::std::os::raw::c_uchar,
        APnDP: ::std::os::raw::c_uchar,
        pData: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_CAN_ACC_MEM_WHILE_RUNNING =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
pub type JLINK_FUNC_UPDATE_BTL =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
pub type JLINK_FUNC_GET_CURRENT_ENDIANESS =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
pub type JLINK_FUNC_ALGODB_GET_PALGO_INFO = ::std::option::Option<
    unsafe extern "C" fn(
        AlgoNo: ::std::os::raw::c_uint,
        Variant: ::std::os::raw::c_uint,
        ppAlgoInfo: *mut *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_ALGODB_GET_PALGO_INFO_CFI = ::std::option::Option<
    unsafe extern "C" fn(
        AlgoNo: ::std::os::raw::c_uint,
        Variant: ::std::os::raw::c_uint,
        NumChips: ::std::os::raw::c_uint,
        NumBits: ::std::os::raw::c_uint,
        CoreType: ::std::os::raw::c_uint,
        ppAlgoInfo: *mut *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_ALGODB_GET_ALGO_NO = ::std::option::Option<
    unsafe extern "C" fn(
        pAlgoInfo: *const ::std::os::raw::c_void,
        pAlgoNo: *mut ::std::os::raw::c_uint,
        pVariant: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_PCODE_SET_ENTRY = ::std::option::Option<
    unsafe extern "C" fn(
        sEntryFunc: *const ::std::os::raw::c_char,
        pPC: *mut ::std::os::raw::c_uint,
        pSP: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_PCODE_DOWNLOAD = ::std::option::Option<
    unsafe extern "C" fn(
        pPCode: *mut ::std::os::raw::c_uchar,
        NumBytes: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_PCODE_DATA_DOWNLOAD = ::std::option::Option<
    unsafe extern "C" fn(
        pData: *mut ::std::os::raw::c_uchar,
        NumBytes: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_PCODE_EXEC_EX = ::std::option::Option<
    unsafe extern "C" fn(
        sEntryFunc: *const ::std::os::raw::c_char,
        pPCodeStat: *mut JLINKARM_EMU_PCODE_STATUS_INFO,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_START_MERGE_COMMANDS =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
pub type JLINK_FUNC_END_MERGE_COMMANDS =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
pub type JLINK_FUNC_RAWTRACE_BIST_STARTSTOP = ::std::option::Option<
    unsafe extern "C" fn(StartBIST: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_RAWTRACE_BIST_READ_ERR_STATS = ::std::option::Option<
    unsafe extern "C" fn(
        paBuffer: *mut JLINK_RAWTRACE_BIST_ERR_BUF_DESC,
        MaxNumItems: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_GET_PF_GET_INST_INFO = ::std::option::Option<
    unsafe extern "C" fn(
        Core: ::std::os::raw::c_uint,
        ppfFunc: *mut JLINK_DISASSEMBLY_FUNC_GET_INST_INFO,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_ACC_APDP_REG_MUL = ::std::option::Option<
    unsafe extern "C" fn(
        paDesc: *mut JLINK_CORESIGHT_APDP_ACC_DESC,
        NumEntries: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_PCODE_EXEC_EX2 = ::std::option::Option<
    unsafe extern "C" fn(
        sEntryFunc: *const ::std::os::raw::c_char,
        pPCodeStat: *mut JLINKARM_EMU_PCODE_STATUS_INFO,
        pParams: *mut ::std::os::raw::c_uint,
        ParamCnt: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_PCODE_FREE =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
pub type JLINK_FUNC_EMU_COMMANDLINE_WRITE_READ = ::std::option::Option<
    unsafe extern "C" fn(
        pDataWrite: *const ::std::os::raw::c_void,
        NumBytesToWrite: ::std::os::raw::c_uint,
        pDataRead: *mut ::std::os::raw::c_void,
        MaxNumBytesToRead: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_GET_PF_DISASSEMBLE_BUFFER = ::std::option::Option<
    unsafe extern "C" fn(
        Core: ::std::os::raw::c_uint,
        ppfFunc: *mut JLINK_DISASSEMBLY_FUNC_DISASSEMBLE_BUFFER,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_EMU_GET_TARGET_IMG_AREA_INFO = ::std::option::Option<
    unsafe extern "C" fn(pInfo: *mut JLINK_EMU_TARGET_IMG_AREA_INFO) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_EMU_READ_TARGET_IMG_AREA = ::std::option::Option<
    unsafe extern "C" fn(
        Off: ::std::os::raw::c_uint,
        NumBytes: ::std::os::raw::c_uint,
        pData: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_EMU_WRITE_TARGET_IMG_AREA = ::std::option::Option<
    unsafe extern "C" fn(
        Off: ::std::os::raw::c_uint,
        NumBytes: ::std::os::raw::c_uint,
        pData: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_EMU_GET_CURR_CONN_INFO = ::std::option::Option<
    unsafe extern "C" fn(pInfo: *mut JLINK_EMU_CURR_CONNECT_INFO) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_GET_PF_EXP_DEVICE_LIST_XML = ::std::option::Option<
    unsafe extern "C" fn(sPath: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_SCRIPTFILE_EXEC_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        sFunc: *const ::std::os::raw::c_char,
        pRetVal: *mut ::std::os::raw::c_longlong,
        paParams: *mut ::std::os::raw::c_uint,
        NumParams: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_ADD_FW_IMAGES = ::std::option::Option<
    unsafe extern "C" fn(
        paFWImg: *const ::std::os::raw::c_void,
        NumImages: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_READ_CSR = ::std::option::Option<
    unsafe extern "C" fn(
        RegIndex: ::std::os::raw::c_uint,
        pData: *mut ::std::os::raw::c_ulonglong,
        RegSize: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_WRITE_CSR = ::std::option::Option<
    unsafe extern "C" fn(
        RegIndex: ::std::os::raw::c_uint,
        Data: ::std::os::raw::c_ulonglong,
        RegSize: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_EMU_FILE_GET_VOLUME_INFO = ::std::option::Option<
    unsafe extern "C" fn(pInfo: *mut JLINK_EMU_FILE_VOLUME_INFO) -> ::std::os::raw::c_int,
>;
pub type JLINK_FUNC_ERASE = ::std::option::Option<
    unsafe extern "C" fn(
        SAddr: ::std::os::raw::c_ulonglong,
        EAddr: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int,
>;
pub type JLINKARM_BP_TYPE = ::std::os::raw::c_uint;
pub const JLINK_EFM8_REG_JLINK_EFM8_R0_B0: JLINK_EFM8_REG = 0;
pub const JLINK_EFM8_REG_JLINK_EFM8_R1_B0: JLINK_EFM8_REG = 1;
pub const JLINK_EFM8_REG_JLINK_EFM8_R2_B0: JLINK_EFM8_REG = 2;
pub const JLINK_EFM8_REG_JLINK_EFM8_R3_B0: JLINK_EFM8_REG = 3;
pub const JLINK_EFM8_REG_JLINK_EFM8_R4_B0: JLINK_EFM8_REG = 4;
pub const JLINK_EFM8_REG_JLINK_EFM8_R5_B0: JLINK_EFM8_REG = 5;
pub const JLINK_EFM8_REG_JLINK_EFM8_R6_B0: JLINK_EFM8_REG = 6;
pub const JLINK_EFM8_REG_JLINK_EFM8_R7_B0: JLINK_EFM8_REG = 7;
pub const JLINK_EFM8_REG_JLINK_EFM8_R0_B1: JLINK_EFM8_REG = 8;
pub const JLINK_EFM8_REG_JLINK_EFM8_R1_B1: JLINK_EFM8_REG = 9;
pub const JLINK_EFM8_REG_JLINK_EFM8_R2_B1: JLINK_EFM8_REG = 10;
pub const JLINK_EFM8_REG_JLINK_EFM8_R3_B1: JLINK_EFM8_REG = 11;
pub const JLINK_EFM8_REG_JLINK_EFM8_R4_B1: JLINK_EFM8_REG = 12;
pub const JLINK_EFM8_REG_JLINK_EFM8_R5_B1: JLINK_EFM8_REG = 13;
pub const JLINK_EFM8_REG_JLINK_EFM8_R6_B1: JLINK_EFM8_REG = 14;
pub const JLINK_EFM8_REG_JLINK_EFM8_R7_B1: JLINK_EFM8_REG = 15;
pub const JLINK_EFM8_REG_JLINK_EFM8_R0_B2: JLINK_EFM8_REG = 16;
pub const JLINK_EFM8_REG_JLINK_EFM8_R1_B2: JLINK_EFM8_REG = 17;
pub const JLINK_EFM8_REG_JLINK_EFM8_R2_B2: JLINK_EFM8_REG = 18;
pub const JLINK_EFM8_REG_JLINK_EFM8_R3_B2: JLINK_EFM8_REG = 19;
pub const JLINK_EFM8_REG_JLINK_EFM8_R4_B2: JLINK_EFM8_REG = 20;
pub const JLINK_EFM8_REG_JLINK_EFM8_R5_B2: JLINK_EFM8_REG = 21;
pub const JLINK_EFM8_REG_JLINK_EFM8_R6_B2: JLINK_EFM8_REG = 22;
pub const JLINK_EFM8_REG_JLINK_EFM8_R7_B2: JLINK_EFM8_REG = 23;
pub const JLINK_EFM8_REG_JLINK_EFM8_R0_B3: JLINK_EFM8_REG = 24;
pub const JLINK_EFM8_REG_JLINK_EFM8_R1_B3: JLINK_EFM8_REG = 25;
pub const JLINK_EFM8_REG_JLINK_EFM8_R2_B3: JLINK_EFM8_REG = 26;
pub const JLINK_EFM8_REG_JLINK_EFM8_R3_B3: JLINK_EFM8_REG = 27;
pub const JLINK_EFM8_REG_JLINK_EFM8_R4_B3: JLINK_EFM8_REG = 28;
pub const JLINK_EFM8_REG_JLINK_EFM8_R5_B3: JLINK_EFM8_REG = 29;
pub const JLINK_EFM8_REG_JLINK_EFM8_R6_B3: JLINK_EFM8_REG = 30;
pub const JLINK_EFM8_REG_JLINK_EFM8_R7_B3: JLINK_EFM8_REG = 31;
pub const JLINK_EFM8_REG_JLINK_EFM8_PC: JLINK_EFM8_REG = 32;
pub const JLINK_EFM8_REG_JLINK_EFM8_A: JLINK_EFM8_REG = 33;
pub const JLINK_EFM8_REG_JLINK_EFM8_B: JLINK_EFM8_REG = 34;
pub const JLINK_EFM8_REG_JLINK_EFM8_DPTR: JLINK_EFM8_REG = 35;
pub const JLINK_EFM8_REG_JLINK_EFM8_SP: JLINK_EFM8_REG = 36;
pub const JLINK_EFM8_REG_JLINK_EFM8_PSW: JLINK_EFM8_REG = 37;
pub const JLINK_EFM8_REG_JLINK_EFM8_R0: JLINK_EFM8_REG = 38;
pub const JLINK_EFM8_REG_JLINK_EFM8_R1: JLINK_EFM8_REG = 39;
pub const JLINK_EFM8_REG_JLINK_EFM8_R2: JLINK_EFM8_REG = 40;
pub const JLINK_EFM8_REG_JLINK_EFM8_R3: JLINK_EFM8_REG = 41;
pub const JLINK_EFM8_REG_JLINK_EFM8_R4: JLINK_EFM8_REG = 42;
pub const JLINK_EFM8_REG_JLINK_EFM8_R5: JLINK_EFM8_REG = 43;
pub const JLINK_EFM8_REG_JLINK_EFM8_R6: JLINK_EFM8_REG = 44;
pub const JLINK_EFM8_REG_JLINK_EFM8_R7: JLINK_EFM8_REG = 45;
pub type JLINK_EFM8_REG = ::std::os::raw::c_uint;
pub type FLASH_AREA_INFO = JLINK_FLASH_AREA_INFO;
pub type RAM_AREA_INFO = JLINK_RAM_AREA_INFO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JLINKARM_READ_DESC {
    pub Addr: ::std::os::raw::c_ulonglong,
    pub NumBytes: ::std::os::raw::c_uint,
    pub Flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_JLINKARM_READ_DESC() {
    assert_eq!(
        ::std::mem::size_of::<JLINKARM_READ_DESC>(),
        16usize,
        concat!("Size of: ", stringify!(JLINKARM_READ_DESC))
    );
    assert_eq!(
        ::std::mem::align_of::<JLINKARM_READ_DESC>(),
        8usize,
        concat!("Alignment of ", stringify!(JLINKARM_READ_DESC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_READ_DESC>())).Addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_READ_DESC),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_READ_DESC>())).NumBytes as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_READ_DESC),
            "::",
            stringify!(NumBytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JLINKARM_READ_DESC>())).Flags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(JLINKARM_READ_DESC),
            "::",
            stringify!(Flags)
        )
    );
}
extern crate libloading;
pub struct JLink {
    __library: ::libloading::Library,
    pub JLINK_Configure: Result<
        unsafe extern "C" fn(pConfig: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
        ::libloading::Error,
    >,
    pub JLINK_DownloadFile: Result<
        unsafe extern "C" fn(
            sFileName: *const ::std::os::raw::c_char,
            Addr: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
        ::libloading::Error,
    >,
    pub JLINK_GetAvailableLicense: Result<
        unsafe extern "C" fn(
            pBuffer: *mut ::std::os::raw::c_char,
            BufferSize: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
        ::libloading::Error,
    >,
    pub JLINK_GetPCode: Result<
        unsafe extern "C" fn(
            PCodeIndex: ::std::os::raw::c_int,
